; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v4 - type_1 ?v3 - type_2)
 	      (pred_4 ?v6 - object ?v3 - type_2)
	      (pred_2 ?v4 - type_1 ?v5 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v7 ?v1 - type_2)
       :precondition (and  (pred_1 ?v4 ?v7))
       :effect (and  (pred_1 ?v4 ?v1)
		     (not (pred_1 ?v4 ?v7))))

   (:action op_3
       :parameters (?v4 - type_1 ?v8 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v2) (pred_1 ?v4 ?v2) (pred_2 ?v4 ?v5))
       :effect (and (pred_3 ?v4 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v2)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_1 ?v8 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v8 ?v5) (pred_1 ?v4 ?v2))
       :effect (and (pred_4 ?v8 ?v2)
		    (pred_2 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_02 - type_1
obj_11 obj_12 obj_06 obj_05 - type_3
obj_09 obj_03 obj_13 obj_10 - type_2
obj_07 obj_04 obj_01 - object)
(:init
(pred_1 obj_08 obj_09)
(pred_2 obj_08 obj_11)
(pred_2 obj_08 obj_12)
(pred_1 obj_02 obj_03)
(pred_2 obj_02 obj_06)
(pred_2 obj_02 obj_05)
(pred_4 obj_07 obj_13)
(pred_4 obj_04 obj_03)
(pred_4 obj_01 obj_13)
)
(:goal
(and
(pred_4 obj_07 obj_10)
(pred_4 obj_04 obj_09)
(pred_4 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_13)))
)
)

; plan
1. (op_3 obj_02 obj_04 obj_03 obj_05)
   deleted: (pred_4 obj_04 obj_03) (pred_2 obj_02 obj_05)
   added: (pred_3 obj_02 obj_04 obj_05)
   goals met: 0 of 3
2. (op_1 obj_08 obj_09 obj_10)
   deleted: (pred_1 obj_08 obj_09)
   added: (pred_1 obj_08 obj_10)
   goals met: 0 of 3
3. (op_1 obj_02 obj_03 obj_09)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_09)
   goals met: 0 of 3
4. (op_2 obj_02 obj_04 obj_09 obj_05)
   deleted: (pred_3 obj_02 obj_04 obj_05)
   added: (pred_4 obj_04 obj_09) (pred_2 obj_02 obj_05)
   goals met: 1 of 3
5. (op_1 obj_02 obj_09 obj_13)
   deleted: (pred_1 obj_02 obj_09)
   added: (pred_1 obj_02 obj_13)
   goals met: 1 of 3
6. (op_3 obj_02 obj_07 obj_13 obj_05)
   deleted: (pred_4 obj_07 obj_13) (pred_2 obj_02 obj_05)
   added: (pred_3 obj_02 obj_07 obj_05)
   goals met: 1 of 3
7. (op_3 obj_02 obj_01 obj_13 obj_06)
   deleted: (pred_4 obj_01 obj_13) (pred_2 obj_02 obj_06)
   added: (pred_3 obj_02 obj_01 obj_06)
   goals met: 1 of 3
8. (op_1 obj_02 obj_13 obj_10)
   deleted: (pred_1 obj_02 obj_13)
   added: (pred_1 obj_02 obj_10)
   goals met: 1 of 3
9. (op_2 obj_02 obj_01 obj_10 obj_06)
   deleted: (pred_3 obj_02 obj_01 obj_06)
   added: (pred_4 obj_01 obj_10) (pred_2 obj_02 obj_06)
   goals met: 2 of 3
10. (op_2 obj_02 obj_07 obj_10 obj_05)
   deleted: (pred_3 obj_02 obj_07 obj_05)
   added: (pred_4 obj_07 obj_10) (pred_2 obj_02 obj_05)
   goals met: 3 of 3
